app/Models/AudioModel.php

SELECT *
FROM `audios`
WHERE `user_id` = '18'
ORDER BY `name` ASC
---
    public function getLastTenUpdated() {
		$user_id = session()->get("id");
        $builder1 = $this->db->table($this->table)
                    ->select($this->table.".*, 1 as 'is_shared', users.email as 'sender_email', 'Audio' as 'filetype'")
                    ->join('shared_'.$this->table, $this->table.'.id = shared_'.$this->table.'.audio_id')
                    ->join('users', 'users.id = shared_'.$this->table.'.sender_id')
                    ->where('shared_'.$this->table.'.receiver_id', $user_id);
        $builder2 = $this->db->table($this->table)
                    ->select("*, 0 as 'is_shared', 0 as 'sender_email', 'Audio' as 'filetype'")
                    ->where("user_id", $user_id);
        $builder1->union($builder2);

        $builder =$this->db->table('(' . $builder1->getCompiledSelect(false) . ') AS union_result');
        $builder->limit(10)
                ->orderBy('uploaded_at DESC, name ASC');
        $query = $builder->get();
        return $query->getResult();