app/Models/AudioModel.php

    public function getAudio($id) {
        parent::__construct();
		$user_id = session()->get("id");
        return $this->where('id', $id)
			->where('user_id', $user_id)
			->first();
---
SELECT *
FROM `audios`
WHERE `id` = '40'
AND `user_id` = '1'
 LIMIT 1

    public function getLastTenUpdated() {
		$user_id = session()->get('id');
        $builder = $this->db->table($this->table)
				->where('user_id', $user_id)
				->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();
        return $query->getResult();
---
SELECT *
FROM `audios`
WHERE `user_id` = '3'
ORDER BY `uploaded_at` DESC
 LIMIT 10
SELECT *
FROM `audios`
WHERE `user_id` = '1'
ORDER BY `uploaded_at` DESC
 LIMIT 10

    public function getAllByName() {
		$user_id = session()->get('id');
        $builder = $this->db->table($this->table)
					->where('user_id', $user_id)
					->orderBy('name', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `audio`
ORDER BY `name` ASC

    public function deleteAudio($id) {
        $this->delete($id);
---
DELETE FROM `audios`
WHERE `id` IN ('40')

    public function getAudioPath($id) {
        parent::__construct();

        $audio = $this->where('id', $id)->first();
---
SELECT *
FROM `audios`
WHERE `id` = '40'
 LIMIT 1