app/Models/ImageModel.php

    public function getAllByName() {
		$user_id = session()->get("id");
        $builder = $this->db->table($this->table)->where('user_id', $user_id)->orderBy('name', 'ASC');
        $query = $builder->get();
---
SELECT *
FROM `images`
WHERE `user_id` = '18'
ORDER BY `name` ASC