app/Models/ImageModel.php

SELECT `images`.*, 0 as 'is_shared', 'image' as 'filetype'
FROM `images`
WHERE `id` = '101'
AND `user_id` = '18'
---
    public function getImage($id) {
        parent::__construct();
		$user_id = session()->get("id");
        return $this->where('id', $id)
			->where('user_id', $user_id)
			->first();

INSERT INTO `images` (`name`, `type`, `path`, `caption`, `updated_at`, `note`, `user_id`) VALUES ('LC 500 Wallpaper', 'image/jpeg', 'C:\\xampp\\htdocs\\mediaProject\\public/images/lc500.jpg', 'lc500.jpg', '2023-06-15 09:03:29', 'Look at this gorgeous Lexus.', '1')
---
    public function saveImage($image) {
        $this->save($image);

SELECT *
FROM `images`
WHERE `user_id` = '3'
ORDER BY `uploaded_at` DESC
 LIMIT 10
SELECT *
FROM `images`
WHERE `user_id` = '1'
ORDER BY `uploaded_at` DESC
 LIMIT 10
---
    public function getLastTenUpdated() {
		$user_id = session()->get("id");
        $builder = $this->db->table($this->table)->where('user_id', $user_id)->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();

SELECT *
FROM `images`
WHERE `user_id` = '3'
ORDER BY `name` ASC
SELECT *
FROM `images`
WHERE `user_id` = '1'
ORDER BY `name` ASC
---
    public function getAllByName() {
		$user_id = session()->get("id");
        $builder = $this->db->table($this->table)->where('user_id', $user_id)->orderBy('name', 'ASC');
        $query = $builder->get();

DELETE FROM `images`
WHERE `id` IN ('260')
---
    public function deleteImage($id) {
		$sharedImgModel = new SharedImageModel();
		$sharedImgModel->deleteByImageId($id);
        $this->delete($id);

SELECT *
FROM `images`
WHERE `id` = '260'
 LIMIT 1
---
    public function getImagePath($id) {
        // Does not work without the parent construct call
        // If you add this to the contructor, it breaks the upload.
        parent::__construct();

        $image = $this->where('id', $id)->first();