app/Models/SharedAudioModel.php

SELECT `shared_Audios`.`id`, `shared_Audios`.`shared_at`, `users`.`email` as `sender_email`, `audios`.*
FROM `shared_Audios`
LEFT JOIN `users` ON `shared_Audios`.`sender_id` = `users`.`id`
LEFT JOIN `audios` ON `shared_Audios`.`audio_id` = `audios`.`id`
WHERE `shared_Audios`.`receiver_id` = '18'
ORDER BY `shared_at` DESC
SELECT `shared_Audios`.`id`, `shared_Audios`.`shared_at`, `users`.`email` as `sender_email`, `audios`.*
FROM `shared_Audios`
LEFT JOIN `users` ON `shared_Audios`.`sender_id` = `users`.`id`
LEFT JOIN `audios` ON `shared_Audios`.`audio_id` = `audios`.`id`
WHERE `shared_Audios`.`receiver_id` = '1'
ORDER BY `shared_at` DESC
 LIMIT 10
---
	public function getLastTenSharedAudios() {
		$user_id = session()->get("id");

		$builder = $this->db->table($this->table)
			->select([
				$this->table.'.id',
				$this->table.'.shared_at',
				'users.email as sender_email',
				'audios.*'
			])
			->join('users', $this->table.'.sender_id = users.id', 'left')
			->join('audios', $this->table.'.audio_id = audios.id', 'left')
			->where($this->table.'.receiver_id', $user_id)
			->orderBy('shared_at', 'DESC')
			->limit(10);

		$query = $builder->get();

DELETE FROM `shared_Audios`
WHERE `audio_id` = '40'
---
	public function deleteByAudioId($id) {
		$this->db->table($this->table)
        ->where('audio_id', $id)
        ->delete();