app/Models/SharedImageModel.php

SELECT `shared_images`.`id`, `shared_images`.`shared_at`, `users`.`email` as `sender_email`, 1 as 'is_shared', `images`.*, 'image' as 'filetype'
FROM `shared_images`
LEFT JOIN `users` ON `shared_images`.`sender_id` = `users`.`id`
LEFT JOIN `images` ON `shared_images`.`image_id` = `images`.`id`
WHERE `shared_images`.`receiver_id` = '18'
AND `images`.`id` = '101'
---
    public function getSharedImages() {
		$user_id = session()->get("id");

		$builder = $this->db->table($this->table)
			->select([
				$this->table.'.id',
				$this->table.'.shared_at',
				'users.email as sender_email',
				'images.*'
			])
			->join('users', $this->table.'.sender_id = users.id', 'left')
			->join('images', $this->table.'.image_id = images.id', 'left')
			->where($this->table.'.receiver_id', $user_id)
			->orderBy('shared_at', 'DESC');

		$query = $builder->get();

SELECT `shared_images`.`id`, `shared_images`.`shared_at`, `users`.`email` as `sender_email`, `images`.*
FROM `shared_images`
LEFT JOIN `users` ON `shared_images`.`sender_id` = `users`.`id`
LEFT JOIN `images` ON `shared_images`.`image_id` = `images`.`id`
WHERE `shared_images`.`receiver_id` = '18'
ORDER BY `shared_at` DESC
SELECT `shared_images`.`id`, `shared_images`.`shared_at`, `users`.`email` as `sender_email`, `images`.*
FROM `shared_images`
LEFT JOIN `users` ON `shared_images`.`sender_id` = `users`.`id`
LEFT JOIN `images` ON `shared_images`.`image_id` = `images`.`id`
WHERE `shared_images`.`receiver_id` = '1'
ORDER BY `shared_at` DESC
 LIMIT 10
---
	public function getLastTenSharedImages() {
		$user_id = session()->get("id");

		$builder = $this->db->table($this->table)
			->select([
				$this->table.'.id',
				$this->table.'.shared_at',
				'users.email as sender_email',
				'images.*'
			])
			->join('users', $this->table.'.sender_id = users.id', 'left')
			->join('images', $this->table.'.image_id = images.id', 'left')
			->where($this->table.'.receiver_id', $user_id)
			->orderBy('shared_at', 'DESC')
			->limit(10);

		$query = $builder->get();

DELETE FROM `shared_images`
WHERE `image_id` = '260'
---
	public function deleteByImageId($id) {
		$this->db->table($this->table)
        ->where('image_id', $id)
        ->delete();