app/Models/SharedVideoModel.php

SELECT `shared_Videos`.`id`, `shared_Videos`.`shared_at`, `users`.`email` as `sender_email`, `videos`.*
FROM `shared_Videos`
LEFT JOIN `users` ON `shared_Videos`.`sender_id` = `users`.`id`
LEFT JOIN `videos` ON `shared_Videos`.`video_id` = `videos`.`id`
WHERE `shared_Videos`.`receiver_id` = '1'
ORDER BY `shared_at` DESC
---
    public function getSharedVideos() {
		$user_id = session()->get("id");

		$builder = $this->db->table($this->table)
			->select([
				$this->table.'.id',
				$this->table.'.shared_at',
				'users.email as sender_email',
				'videos.*'
			])
			->join('users', $this->table.'.sender_id = users.id', 'left')
			->join('videos', $this->table.'.video_id = videos.id', 'left')
			->where($this->table.'.receiver_id', $user_id)
			->orderBy('shared_at', 'DESC');

		$query = $builder->get();

SELECT `shared_Videos`.`id`, `shared_Videos`.`shared_at`, `users`.`email` as `sender_email`, `videos`.*
FROM `shared_Videos`
LEFT JOIN `users` ON `shared_Videos`.`sender_id` = `users`.`id`
LEFT JOIN `videos` ON `shared_Videos`.`video_id` = `videos`.`id`
WHERE `shared_Videos`.`receiver_id` = '1'
ORDER BY `shared_at` DESC
 LIMIT 10
---
	public function getLastTenSharedVideos() {
		$user_id = session()->get("id");

		$builder = $this->db->table($this->table)
			->select([
				$this->table.'.id',
				$this->table.'.shared_at',
				'users.email as sender_email',
				'videos.*'
			])
			->join('users', $this->table.'.sender_id = users.id', 'left')
			->join('videos', $this->table.'.video_id = videos.id', 'left')
			->where($this->table.'.receiver_id', $user_id)
			->orderBy('shared_at', 'DESC')
			->limit(10);

		$query = $builder->get();

DELETE FROM `shared_Videos`
WHERE `video_id` = '40'
---
	public function deleteByVideoId($id) {
		$this->db->table($this->table)
        ->where('video_id', $id)
        ->delete();