app/Models/UserModel.php

    public function getUser($email) {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'egonza100@calstatela.edu'
 LIMIT 1