app/Models/VideoModel.php

    public function getVideo($id) {
        parent::__construct();
		$user_id = session()->get("id");
        return $this->where('id', $id)
			->where('user_id', $user_id)
			->first();
---
SELECT *
FROM `videos`
WHERE `id` = '16'
AND `user_id` = '3'
 LIMIT 1

    public function getLastTenUpdated() {
		$user_id = session()->get("id");
        $builder = $this->db->table($this->table)
				->where('user_id', $user_id)
				->orderBy('uploaded_at','DESC')->limit(10);
        $query = $builder->get();
        return $query->getResult();
---
SELECT *
FROM `videos`
WHERE `user_id` = '3'
ORDER BY `uploaded_at` DESC
 LIMIT 10
SELECT *
FROM `videos`
WHERE `user_id` = '1'
ORDER BY `uploaded_at` DESC
 LIMIT 10

    public function getAllByName() {
		$user_id = session()->get("id");
		$builder = $this->db->table($this->table)
			->where('user_id', $user_id)
			->orderBy('name', 'ASC');
        $query = $builder->get();
        return $query->getResult();
---
SELECT *
FROM `videos`
WHERE `user_id` = '3'
ORDER BY `name` ASC
SELECT *
FROM `videos`
WHERE `user_id` = '1'
ORDER BY `name` ASC

    public function deleteVideo($id) {
        $this->delete($id);
---
DELETE FROM `videos`
WHERE `id` IN ('16')

    public function getVideoPath($id) {
        parent::__construct();

        $video = $this->where('id', $id)->first();
---
SELECT *
FROM `videos`
WHERE `id` = '16'
 LIMIT 1